
// 문자열 배열 다루기

public class ArrayBasic211 {

	public static void main(String[] args) {

//		홀짝 게임, 종료
//		
//		라는 메뉴가 있다
//		
//		키보드 입력을 받아서 
//		홀짝 게임을 입력하면 
//		
//		홀짝 게임이 실행되고
//		종료 버튼을 누르면 프로그램이 종료되는 시스템을 개발하시오
		
//		홀짝 게임 로직
//		사용자는 홀 짝 둘 중 하나만 입력가능하다
//		
//		컴의 랜덤한 1~10 까지의 숫자 중 하나가 나와서 
//		진행된다
//		홀, 짝 중 맞추면 
//		컴의 숫자를 출력하며 맞췄다고 알려주고
//		틀렸다면
//		컴의 숫자를 출력하며 틀렸다고 알려준다
//		
//		한 판 끝나면 다시 하겠습니까?(y, Y or n, N)
//		이 출력되고 n을 누루면 종료되고
//		y를 누르면 홀짝게임을 다시 시작하시오
		
		
	}

}
