
// 조건문 if
public class ControlBasic136 {

	public static void main(String[] args) {
		
//		프로그램의 흐름을 바꾸는 역할을 하는 문장들을
//		제어문이라고 한다
//		제어문에는 조건문과 반복문이 있다
//		조건문은 조건에 따라 다른 문장이 수행되도록 하고,
//		반복문은 특정 문장들을 반복해서 수행한다
//		
//		if(조건식) {
//			//조건식이 참일 때 수행될 문장들을 적는다
//		}
		
		int scoreNum = 60;
		
		if(scoreNum >= 60) {
			System.out.println("합격입니다.");
			System.out.println("ㄴㅇㄹㄴㅇㄹ.");
		}
		
//		블럭{}
//		{이런 기호를 블럭(block)이라고 부르며 
//		여러 문장을 하나의 단위로 묶는데 사용된다
//		블럭은 {로 시작해서 }로 끝나는데 
//		}다음에 문장의 끝을 의미하는 ;을 붙이지 않는다는 것에 주의하자
//		블럭 내의 문장들은 탭(tab)으로 들여쓰기를 해서 블럭 안에 속한 
//		문장이라는 것을 알기 쉽게 해주는 것이 좋다
		
	}
	
}
